Revit 2026 API

# PointLoadPoint Property

---

Returns the position of point load, measured in decimal feet.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Point { get; set; }
```
```vb
Public Property Point As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Point : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: This PointLoad is not a hosted load. -or- When setting this property: This PointLoad is a constrained load. |

Loacation can be set only for hosted loads. This method works for loads which are not constrained to their host. To determine if load is hosted use IsHosted property.

#### Reference

PointLoad Class

Autodesk.Revit.DB.Structure Namespace